Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Saheeh International.tmx
Source language: ar
Languages: en

source: وعجبوا أن جاءهم منذر منهم وقال الكافرون هذا ساحر كذاب
en: And they wonder that there has come to them a warner from among themselves. And the disbelievers say, "This is a magician and a liar.

source: أجعل الآلهة إلها واحدا إن هذا لشيء عجاب
en: Has he made the gods [only] one God? Indeed, this is a curious thing."

source: وانطلق الملأ منهم أن امشوا واصبروا على آلهتكم إن هذا لشيء يراد
en: And the eminent among them went forth, [saying], "Continue, and be patient over [the defense of] your gods. Indeed, this is a thing intended.

source: ما سمعنا بهذا في الملة الآخرة إن هذا إلا اختلاق
en: We have not heard of this in the latest religion. This is not but a fabrication.

source: أأنزل عليه الذكر من بيننا بل هم في شك من ذكري بل لما يذوقوا عذاب
en: Has the message been revealed to him out of [all of] us?" Rather, they are in doubt about My message. Rather, they have not yet tasted My punishment.

source: أم عندهم خزائن رحمة ربك العزيز الوهاب
en: Or do they have the depositories of the mercy of your Lord, the Exalted in Might, the Bestower?

source: أم لهم ملك السماوات والأرض وما بينهما فليرتقوا في الأسباب
en: Or is theirs the dominion of the heavens and the earth and what is between them? Then let them ascend through [any] ways of access.

source: جند ما هنالك مهزوم من الأحزاب
en: [They are but] soldiers [who will be] defeated there among the companies [of disbelievers].

source: كذبت قبلهم قوم نوح وعاد وفرعون ذو الأوتاد
en: The people of Noah denied before them, and [the tribe of] 'Aad and Pharaoh, the owner of stakes,

source: وثمود وقوم لوط وأصحاب الأيكة أولئك الأحزاب
en: And [the tribe of] Thamud and the people of Lot and the companions of the thicket. Those are the companies.

source: إن كل إلا كذب الرسل فحق عقاب
en: Each of them denied the messengers, so My penalty was justified.

source: وما ينظر هؤلاء إلا صيحة واحدة ما لها من فواق
en: And these [disbelievers] await not but one blast [of the Horn]; for it there will be no delay.

source: وقالوا ربنا عجل لنا قطنا قبل يوم الحساب
en: And they say, "Our Lord, hasten for us our share [of the punishment] before the Day of Account"

source: اصبر على ما يقولون واذكر عبدنا داوود ذا الأيد إنه أواب
en: Be patient over what they say and remember Our servant, David, the possessor of strength; indeed, he was one who repeatedly turned back [to Allah].

source: إنا سخرنا الجبال معه يسبحن بالعشي والإشراق
en: Indeed, We subjected the mountains [to praise] with him, exalting [Allah] in the [late] afternoon and [after] sunrise.

source: والطير محشورة كل له أواب
en: And the birds were assembled, all with him repeating [praises].

source: وشددنا ملكه وآتيناه الحكمة وفصل الخطاب
en: And We strengthened his kingdom and gave him wisdom and discernment in speech.

source: وهل أتاك نبأ الخصم إذ تسوروا المحراب
en: And has there come to you the news of the adversaries, when they climbed over the wall of [his] prayer chamber -

source: إذ دخلوا على داوود ففزع منهم قالوا لا تخف خصمان بغى بعضنا على بعض فاحكم بيننا بالحق ولا تشطط واهدنا إلى سواء الصراط
en: When they entered upon David and he was alarmed by them? They said, "Fear not. [We are] two adversaries, one of whom has wronged the other, so judge between us with truth and do not exceed [it] and guide us to the sound path.

source: إن هذا أخي له تسع وتسعون نعجة ولي نعجة واحدة فقال أكفلنيها وعزني في الخطاب
en: Indeed this, my brother, has ninety-nine ewes, and I have one ewe; so he said, 'Entrust her to me,' and he overpowered me in speech."

source: قال لقد ظلمك بسؤال نعجتك إلى نعاجه وإن كثيرا من الخلطاء ليبغي بعضهم على بعض إلا الذين آمنوا وعملوا الصالحات وقليل ما هم وظن داوود أنما فتناه فاستغفر ربه وخر راكعا وأناب
en: [David] said, "He has certainly wronged you in demanding your ewe [in addition] to his ewes. And indeed, many associates oppress one another, except for those who believe and do righteous deeds - and few are they." And David became certain that We had tried him, and he asked forgiveness of his Lord and fell down bowing [in prostration] and turned in repentance [to Allah].

source: فغفرنا له ذلك وإن له عندنا لزلفى وحسن مآب
en: So We forgave him that; and indeed, for him is nearness to Us and a good place of return.

source: يا داوود إنا جعلناك خليفة في الأرض فاحكم بين الناس بالحق ولا تتبع الهوى فيضلك عن سبيل الله إن الذين يضلون عن سبيل الله لهم عذاب شديد بما نسوا يوم الحساب
en: [We said], "O David, indeed We have made you a successor upon the earth, so judge between the people in truth and do not follow [your own] desire, as it will lead you astray from the way of Allah." Indeed, those who go astray from the way of Allah will have a severe punishment for having forgotten the Day of Account.

source: وما خلقنا السماء والأرض وما بينهما باطلا ذلك ظن الذين كفروا فويل للذين كفروا من النار
en: And We did not create the heaven and the earth and that between them aimlessly. That is the assumption of those who disbelieve, so woe to those who disbelieve from the Fire.

source: أم نجعل الذين آمنوا وعملوا الصالحات كالمفسدين في الأرض أم نجعل المتقين كالفجار
en: Or should we treat those who believe and do righteous deeds like corrupters in the land? Or should We treat those who fear Allah like the wicked?

source: كتاب أنزلناه إليك مبارك ليدبروا آياته وليتذكر أولو الألباب
en: [This is] a blessed Book which We have revealed to you, [O Muhammad], that they might reflect upon its verses and that those of understanding would be reminded.

source: ووهبنا لداوود سليمان نعم العبد إنه أواب
en: And to David We gave Solomon. An excellent servant, indeed he was one repeatedly turning back [to Allah].

source: إذ عرض عليه بالعشي الصافنات الجياد
en: [Mention] when there were exhibited before him in the afternoon the poised [standing] racehorses.

source: فقال إني أحببت حب الخير عن ذكر ربي حتى توارت بالحجاب
en: And he said, "Indeed, I gave preference to the love of good [things] over the remembrance of my Lord until the sun disappeared into the curtain [of darkness]."

source: ردوها علي فطفق مسحا بالسوق والأعناق
en: [He said], "Return them to me," and set about striking [their] legs and necks.

source: ولقد فتنا سليمان وألقينا على كرسيه جسدا ثم أناب
en: And We certainly tried Solomon and placed on his throne a body; then he returned.

source: قال رب اغفر لي وهب لي ملكا لا ينبغي لأحد من بعدي إنك أنت الوهاب
en: He said, "My Lord, forgive me and grant me a kingdom such as will not belong to anyone after me. Indeed, You are the Bestower."

source: فسخرنا له الريح تجري بأمره رخاء حيث أصاب
en: So We subjected to him the wind blowing by his command, gently, wherever he directed,

source: والشياطين كل بناء وغواص
en: And [also] the devils [of jinn] - every builder and diver

source: وآخرين مقرنين في الأصفاد
en: And others bound together in shackles.

source: هذا عطاؤنا فامنن أو أمسك بغير حساب
en: [We said], "This is Our gift, so grant or withhold without account."

source: وإن له عندنا لزلفى وحسن مآب
en: And indeed, for him is nearness to Us and a good place of return.

source: واذكر عبدنا أيوب إذ نادى ربه أني مسني الشيطان بنصب وعذاب
en: And remember Our servant Job, when he called to his Lord, "Indeed, Satan has touched me with hardship and torment."

source: اركض برجلك هذا مغتسل بارد وشراب
en: [So he was told], "Strike [the ground] with your foot; this is a [spring for] a cool bath and drink."

source: ووهبنا له أهله ومثلهم معهم رحمة منا وذكرى لأولي الألباب
en: And We granted him his family and a like [number] with them as mercy from Us and a reminder for those of understanding.

source: وخذ بيدك ضغثا فاضرب به ولا تحنث إنا وجدناه صابرا نعم العبد إنه أواب
en: [We said], "And take in your hand a bunch [of grass] and strike with it and do not break your oath." Indeed, We found him patient, an excellent servant. Indeed, he was one repeatedly turning back [to Allah].

source: واذكر عبادنا إبراهيم وإسحاق ويعقوب أولي الأيدي والأبصار
en: And remember Our servants, Abraham, Isaac and Jacob - those of strength and [religious] vision.

source: إنا أخلصناهم بخالصة ذكرى الدار
en: Indeed, We chose them for an exclusive quality: remembrance of the home [of the Hereafter].

source: وإنهم عندنا لمن المصطفين الأخيار
en: And indeed they are, to Us, among the chosen and outstanding.

source: واذكر إسماعيل واليسع وذا الكفل وكل من الأخيار
en: And remember Ishmael, Elisha and Dhul-Kifl, and all are among the outstanding.

source: هذا ذكر وإن للمتقين لحسن مآب
en: This is a reminder. And indeed, for the righteous is a good place of return

source: جنات عدن مفتحة لهم الأبواب
en: Gardens of perpetual residence, whose doors will be opened to them.

source: متكئين فيها يدعون فيها بفاكهة كثيرة وشراب
en: Reclining within them, they will call therein for abundant fruit and drink.

source: وعندهم قاصرات الطرف أتراب
en: And with them will be women limiting [their] glances and of equal age.

source: هذا ما توعدون ليوم الحساب
en: This is what you, [the righteous], are promised for the Day of Account.

source: إن هذا لرزقنا ما له من نفاد
en: Indeed, this is Our provision; for it there is no depletion.

source: هذا وإن للطاغين لشر مآب
en: This [is so]. But indeed, for the transgressors is an evil place of return -

source: جهنم يصلونها فبئس المهاد
en: Hell, which they will [enter to] burn, and wretched is the resting place.

source: هذا فليذوقوه حميم وغساق
en: This - so let them taste it - is scalding water and [foul] purulence.

source: وآخر من شكله أزواج
en: And other [punishments] of its type [in various] kinds.

source: هذا فوج مقتحم معكم لا مرحبا بهم إنهم صالو النار
en: [Its inhabitants will say], "This is a company bursting in with you. No welcome for them. Indeed, they will burn in the Fire."

source: قالوا بل أنتم لا مرحبا بكم أنتم قدمتموه لنا فبئس القرار
en: They will say, "Nor you! No welcome for you. You, [our leaders], brought this upon us, and wretched is the settlement."

source: قالوا ربنا من قدم لنا هذا فزده عذابا ضعفا في النار
en: They will say, "Our Lord, whoever brought this upon us - increase for him double punishment in the Fire."

source: وقالوا ما لنا لا نرى رجالا كنا نعدهم من الأشرار
en: And they will say, "Why do we not see men whom we used to count among the worst?

source: أتخذناهم سخريا أم زاغت عنهم الأبصار
en: Is it [because] we took them in ridicule, or has [our] vision turned away from them?"

source: إن ذلك لحق تخاصم أهل النار
en: Indeed, that is truth - the quarreling of the people of the Fire.

source: قل إنما أنا منذر وما من إله إلا الله الواحد القهار
en: Say, [O Muhammad], "I am only a warner, and there is not any deity except Allah, the One, the Prevailing.

source: رب السماوات والأرض وما بينهما العزيز الغفار
en: Lord of the heavens and the earth and whatever is between them, the Exalted in Might, the Perpetual Forgiver."

source: قل هو نبأ عظيم
en: Say, "It is great news

source: أنتم عنه معرضون
en: From which you turn away.

source: ما كان لي من علم بالملإ الأعلى إذ يختصمون
en: I had no knowledge of the exalted assembly [of angels] when they were disputing [the creation of Adam].

source: إن يوحى إلي إلا أنما أنا نذير مبين
en: It has not been revealed to me except that I am a clear warner."

source: إذ قال ربك للملائكة إني خالق بشرا من طين
en: [So mention] when your Lord said to the angels, "Indeed, I am going to create a human being from clay.

source: إلا إبليس استكبر وكان من الكافرين
en: Except Iblees; he was arrogant and became among the disbelievers.

source: قال يا إبليس ما منعك أن تسجد لما خلقت بيدي أستكبرت أم كنت من العالين
en: [Allah] said, "O Iblees, what prevented you from prostrating to that which I created with My hands? Were you arrogant [then], or were you [already] among the haughty?"

source: قال أنا خير منه خلقتني من نار وخلقته من طين
en: He said, "I am better than him. You created me from fire and created him from clay."

source: وإن عليك لعنتي إلى يوم الدين
en: And indeed, upon you is My curse until the Day of Recompense."

source: قال فبعزتك لأغوينهم أجمعين
en: [Iblees] said, "By your might, I will surely mislead them all

source: قال فالحق والحق أقول
en: [Allah] said, "The truth [is My oath], and the truth I say -

source: لأملأن جهنم منك وممن تبعك منهم أجمعين
en: [That] I will surely fill Hell with you and those of them that follow you all together."

source: قل ما أسألكم عليه من أجر وما أنا من المتكلفين
en: Say, [O Muhammad], "I do not ask you for the Qur'an any payment, and I am not of the pretentious

source: إن هو إلا ذكر للعالمين
en: It is but a reminder to the worlds.

source: ولتعلمن نبأه بعد حين
en: And you will surely know [the truth of] its information after a time."

source: تنزيل الكتاب من الله العزيز الحكيم
en: The revelation of the Qur'an is from Allah, the Exalted in Might, the Wise.

source: إنا أنزلنا إليك الكتاب بالحق فاعبد الله مخلصا له الدين
en: Indeed, We have sent down to you the Book, [O Muhammad], in truth. So worship Allah, [being] sincere to Him in religion.

source: ألا لله الدين الخالص والذين اتخذوا من دونه أولياء ما نعبدهم إلا ليقربونا إلى الله زلفى إن الله يحكم بينهم في ما هم فيه يختلفون إن الله لا يهدي من هو كاذب كفار
en: Unquestionably, for Allah is the pure religion. And those who take protectors besides Him [say], "We only worship them that they may bring us nearer to Allah in position." Indeed, Allah will judge between them concerning that over which they differ. Indeed, Allah does not guide he who is a liar and [confirmed] disbeliever.

source: لو أراد الله أن يتخذ ولدا لاصطفى مما يخلق ما يشاء سبحانه هو الله الواحد القهار
en: If Allah had intended to take a son, He could have chosen from what He creates whatever He willed. Exalted is He; He is Allah, the One, the Prevailing.

source: خلق السماوات والأرض بالحق يكور الليل على النهار ويكور النهار على الليل وسخر الشمس والقمر كل يجري لأجل مسمى ألا هو العزيز الغفار
en: He created the heavens and earth in truth. He wraps the night over the day and wraps the day over the night and has subjected the sun and the moon, each running [its course] for a specified term. Unquestionably, He is the Exalted in Might, the Perpetual Forgiver.

source: خلقكم من نفس واحدة ثم جعل منها زوجها وأنزل لكم من الأنعام ثمانية أزواج يخلقكم في بطون أمهاتكم خلقا من بعد خلق في ظلمات ثلاث ذلكم الله ربكم له الملك لا إله إلا هو فأنى تصرفون
en: He created you from one soul. Then He made from it its mate, and He produced for you from the grazing livestock eight mates. He creates you in the wombs of your mothers, creation after creation, within three darknesses. That is Allah, your Lord; to Him belongs dominion. There is no deity except Him, so how are you averted?

source: إن تكفروا فإن الله غني عنكم ولا يرضى لعباده الكفر وإن تشكروا يرضه لكم ولا تزر وازرة وزر أخرى ثم إلى ربكم مرجعكم فينبئكم بما كنتم تعملون إنه عليم بذات الصدور
en: If you disbelieve - indeed, Allah is Free from need of you. And He does not approve for His servants disbelief. And if you are grateful, He approves it for you; and no bearer of burdens will bear the burden of another. Then to your Lord is your return, and He will inform you about what you used to do. Indeed, He is Knowing of that within the breasts.

source: وإذا مس الإنسان ضر دعا ربه منيبا إليه ثم إذا خوله نعمة منه نسي ما كان يدعو إليه من قبل وجعل لله أندادا ليضل عن سبيله قل تمتع بكفرك قليلا إنك من أصحاب النار
en: And when adversity touches man, he calls upon his Lord, turning to Him [alone]; then when He bestows on him a favor from Himself, he forgets Him whom he called upon before, and he attributes to Allah equals to mislead [people] from His way. Say, "Enjoy your disbelief for a little; indeed, you are of the companions of the Fire."

source: أمن هو قانت آناء الليل ساجدا وقائما يحذر الآخرة ويرجو رحمة ربه قل هل يستوي الذين يعلمون والذين لا يعلمون إنما يتذكر أولو الألباب
en: Is one who is devoutly obedient during periods of the night, prostrating and standing [in prayer], fearing the Hereafter and hoping for the mercy of his Lord, [like one who does not]? Say, "Are those who know equal to those who do not know?" Only they will remember [who are] people of understanding.

source: قل يا عباد الذين آمنوا اتقوا ربكم للذين أحسنوا في هذه الدنيا حسنة وأرض الله واسعة إنما يوفى الصابرون أجرهم بغير حساب
en: Say, "O My servants who have believed, fear your Lord. For those who do good in this world is good, and the earth of Allah is spacious. Indeed, the patient will be given their reward without account."

source: قل إني أمرت أن أعبد الله مخلصا له الدين
en: Say, [O Muhammad], "Indeed, I have been commanded to worship Allah, [being] sincere to Him in religion.

source: وأمرت لأن أكون أول المسلمين
en: And I have been commanded to be the first [among you] of the Muslims."

source: قل الله أعبد مخلصا له ديني
en: Say, "Allah [alone] do I worship, sincere to Him in my religion,

source: فاعبدوا ما شئتم من دونه قل إن الخاسرين الذين خسروا أنفسهم وأهليهم يوم القيامة ألا ذلك هو الخسران المبين
en: So worship what you will besides Him." Say, "Indeed, the losers are the ones who will lose themselves and their families on the Day of Resurrection. Unquestionably, that is the manifest loss."

source: لهم من فوقهم ظلل من النار ومن تحتهم ظلل ذلك يخوف الله به عباده يا عباد فاتقون
en: They will have canopies of fire above them and below them, canopies. By that Allah threatens His servants. O My servants, then fear Me.

source: والذين اجتنبوا الطاغوت أن يعبدوها وأنابوا إلى الله لهم البشرى فبشر عباد
en: But those who have avoided Taghut, lest they worship it, and turned back to Allah - for them are good tidings. So give good tidings to My servants

source: الذين يستمعون القول فيتبعون أحسنه أولئك الذين هداهم الله وأولئك هم أولو الألباب
en: Who listen to speech and follow the best of it. Those are the ones Allah has guided, and those are people of understanding.

source: أفمن حق عليه كلمة العذاب أفأنت تنقذ من في النار
en: Then, is one who has deserved the decree of punishment [to be guided]? Then, can you save one who is in the Fire?

source: لكن الذين اتقوا ربهم لهم غرف من فوقها غرف مبنية تجري من تحتها الأنهار وعد الله لا يخلف الله الميعاد
en: But those who have feared their Lord - for them are chambers, above them chambers built high, beneath which rivers flow. [This is] the promise of Allah. Allah does not fail in [His] promise.

source: ألم تر أن الله أنزل من السماء ماء فسلكه ينابيع في الأرض ثم يخرج به زرعا مختلفا ألوانه ثم يهيج فتراه مصفرا ثم يجعله حطاما إن في ذلك لذكرى لأولي الألباب
en: Do you not see that Allah sends down rain from the sky and makes it flow as springs [and rivers] in the earth; then He produces thereby crops of varying colors; then they dry and you see them turned yellow; then He makes them [scattered] debris. Indeed in that is a reminder for those of understanding.

source: أفمن شرح الله صدره للإسلام فهو على نور من ربه فويل للقاسية قلوبهم من ذكر الله أولئك في ضلال مبين
en: So is one whose breast Allah has expanded to [accept] Islam and he is upon a light from his Lord [like one whose heart rejects it]? Then woe to those whose hearts are hardened against the remembrance of Allah. Those are in manifest error.

source: الله نزل أحسن الحديث كتابا متشابها مثاني تقشعر منه جلود الذين يخشون ربهم ثم تلين جلودهم وقلوبهم إلى ذكر الله ذلك هدى الله يهدي به من يشاء ومن يضلل الله فما له من هاد
en: Allah has sent down the best statement: a consistent Book wherein is reiteration. The skins shiver therefrom of those who fear their Lord; then their skins and their hearts relax at the remembrance of Allah. That is the guidance of Allah by which He guides whom He wills. And one whom Allah leaves astray - for him there is no guide.

source: أفمن يتقي بوجهه سوء العذاب يوم القيامة وقيل للظالمين ذوقوا ما كنتم تكسبون
en: Then is he who will shield with his face the worst of the punishment on the Day of Resurrection [like one secure from it]? And it will be said to the wrongdoers, "Taste what you used to earn."

source: كذب الذين من قبلهم فأتاهم العذاب من حيث لا يشعرون
en: Those before them denied, and punishment came upon them from where they did not perceive.

source: فأذاقهم الله الخزي في الحياة الدنيا ولعذاب الآخرة أكبر لو كانوا يعلمون
en: So Allah made them taste disgrace in worldly life. But the punishment of the Hereafter is greater, if they only knew.

source: ولقد ضربنا للناس في هذا القرآن من كل مثل لعلهم يتذكرون
en: And We have certainly presented for the people in this Qur'an from every [kind of] example - that they might remember.

source: قرآنا عربيا غير ذي عوج لعلهم يتقون
en: [It is] an Arabic Qur'an, without any deviance that they might become righteous.

source: ضرب الله مثلا رجلا فيه شركاء متشاكسون ورجلا سلما لرجل هل يستويان مثلا الحمد لله بل أكثرهم لا يعلمون
en: Allah presents an example: a slave owned by quarreling partners and another belonging exclusively to one man - are they equal in comparison? Praise be to Allah! But most of them do not know.

source: إنك ميت وإنهم ميتون
en: Indeed, you are to die, and indeed, they are to die.

source: ثم إنكم يوم القيامة عند ربكم تختصمون
en: Then indeed you, on the Day of Resurrection, before your Lord, will dispute.

source: فمن أظلم ممن كذب على الله وكذب بالصدق إذ جاءه أليس في جهنم مثوى للكافرين
en: So who is more unjust than one who lies about Allah and denies the truth when it has come to him? Is there not in Hell a residence for the disbelievers?

source: والذي جاء بالصدق وصدق به أولئك هم المتقون
en: And the one who has brought the truth and [they who] believed in it - those are the righteous.

source: لهم ما يشاءون عند ربهم ذلك جزاء المحسنين
en: They will have whatever they desire with their Lord. That is the reward of the doers of good -

source: ليكفر الله عنهم أسوأ الذي عملوا ويجزيهم أجرهم بأحسن الذي كانوا يعملون
en: That Allah may remove from them the worst of what they did and reward them their due for the best of what they used to do.

source: أليس الله بكاف عبده ويخوفونك بالذين من دونه ومن يضلل الله فما له من هاد
en: Is not Allah sufficient for His Servant [Prophet Muhammad]? And [yet], they threaten you with those [they worship] other than Him. And whoever Allah leaves astray - for him there is no guide.

source: ومن يهد الله فما له من مضل أليس الله بعزيز ذي انتقام
en: And whoever Allah guides - for him there is no misleader. Is not Allah Exalted in Might and Owner of Retribution?

source: ولئن سألتهم من خلق السماوات والأرض ليقولن الله قل أفرأيتم ما تدعون من دون الله إن أرادني الله بضر هل هن كاشفات ضره أو أرادني برحمة هل هن ممسكات رحمته قل حسبي الله عليه يتوكل المتوكلون
en: And if you asked them, "Who created the heavens and the earth?" they would surely say, "Allah." Say, "Then have you considered what you invoke besides Allah? If Allah intended me harm, are they removers of His harm; or if He intended me mercy, are they withholders of His mercy?" Say, "Sufficient for me is Allah; upon Him [alone] rely the [wise] reliers."

source: قل يا قوم اعملوا على مكانتكم إني عامل فسوف تعلمون
en: Say, "O my people, work according to your position, [for] indeed, I am working; and you are going to know

source: من يأتيه عذاب يخزيه ويحل عليه عذاب مقيم
en: To whom will come a torment disgracing him and on whom will descend an enduring punishment."

source: إنا أنزلنا عليك الكتاب للناس بالحق فمن اهتدى فلنفسه ومن ضل فإنما يضل عليها وما أنت عليهم بوكيل
en: Indeed, We sent down to you the Book for the people in truth. So whoever is guided - it is for [the benefit of] his soul; and whoever goes astray only goes astray to its detriment. And you are not a manager over them.

source: الله يتوفى الأنفس حين موتها والتي لم تمت في منامها فيمسك التي قضى عليها الموت ويرسل الأخرى إلى أجل مسمى إن في ذلك لآيات لقوم يتفكرون
en: Allah takes the souls at the time of their death, and those that do not die [He takes] during their sleep. Then He keeps those for which He has decreed death and releases the others for a specified term. Indeed in that are signs for a people who give thought.
